#region whiteHorse — 27.12.2021

//  1) Игра астероиды.Можно управлять кораблем. Стрелять пулей с n-задержкой.Враги - астероиды (одного размера)

#endregion


#region whiteHorse — 11.01.2022

//  2) Игра астероиды.Можно управлять кораблем с клавиатуры без использования мыши.
//  стрельба происходит автоматически по наведению на противников.
//  Стрелять пулей с n-задержкой. Враги - астероиды могут быть 3 типов.
//  1 - маленький астероид с маленьким количеством здоровья.
//  2 - большой астероид с большим количеством здоровья.
//  3 - космический корабль с большим количеством здоровья и броней.

#endregion


#region whiteHorse — 18.01.2022

//  3) Игра астероиды.
//  Можно управлять кораблем с клавиатуры без использования мыши.
//  стрельба происходит автоматически по наведению на противников.
//  Стрелять пулей с n-задержкой.Враги - астероиды могут быть 3 типов.
//  1 - маленький астероид с маленьким количеством здоровья.
//  2 - большой астероид с большим количеством здоровья.
//  3 - космический корабль с большим количеством здоровья и броней.
//  Если враг столкнется с кораблём игрока, то выходит экран поражения и через n секунд откроется меню игры.
//  Фоновая музыка. Звуки по нажатию кнопок меню.
//  Звуки по попаданию в противника(звук в астероид и в корабль должны отличаться). Звук поражения.
//
//  Игра стартует с главного меню. 
//      - Старт
//      - Настройки (звук, качество картинки)
//      - Выход из игры
//  В самой игре есть меню
//      - Выход в главное меню
//      - Продолжить

#region 3.1-MainMenu

//  Игра стартует с главного меню. 
//  - Старт
//  - Настройки (звук, качество картинки)
//  - Выход из игры

#endregion

#region 3.2-PauseMenu

//  В самой игре есть меню
//  - Выход в главное меню
//  - Продолжить

#endregion

#region 3.3-SFX_UI

//  Звуки по нажатию кнопок меню.

#endregion

#region 3.4-Music

//  Фоновая музыка.

#endregion

#region 3.5-SFX_Game

//  Звуки по попаданию в противника (звук в астероид и в корабль должны отличаться). 
//  Звук поражения.

#endregion

#region 3.6-GameLose

//  Если враг столкнется с кораблём игрока, то выходит экран поражения и через n секунд откроется меню игры.

#endregion

#endregion